## Plan for org_account/guardrails_alerting
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**❌ &nbsp; Terraform Format:** `failed`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**🧹 &nbsp; Format:** run `terraform fmt` to fix the following: 
```sh
eventbridge.tf
```
**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 15 to add, 1 to change, 3 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                      NAME                                      |
|----------|--------------------------------------------------------------------------------|
| add      | `aws_cloudwatch_event_rule.guardrails_breakglass_signin_monitoring`            |
|          | `aws_cloudwatch_event_rule.guardrails_iam_admin_policy_monitoring_demotion`    |
|          | `aws_cloudwatch_event_rule.guardrails_iam_admin_policy_monitoring_promotion`   |
|          | `aws_cloudwatch_event_rule.guardrails_kms_monitoring`                          |
|          | `aws_cloudwatch_event_rule.guardrails_root_signin_monitoring`                  |
|          | `aws_cloudwatch_event_rule.guardrails_secrets_manager_monitoring`              |
|          | `aws_cloudwatch_event_target.guardrails_breakglass_signin_sns_target`          |
|          | `aws_cloudwatch_event_target.guardrails_iam_admin_demotion_policy_sns_target`  |
|          | `aws_cloudwatch_event_target.guardrails_iam_admin_promotion_policy_sns_target` |
|          | `aws_cloudwatch_event_target.guardrails_kms_sns_target`                        |
|          | `aws_cloudwatch_event_target.guardrails_root_signin_sns_target`                |
|          | `aws_cloudwatch_event_target.guardrails_secrets_manager_sns_target`            |
|          | `aws_sns_topic.guardrail_alerts`                                               |
|          | `aws_sns_topic_policy.guardrail_alerts_policy`                                 |
| delete   | `aws_sns_topic.cloud_brokering_alerts`                                         |
|          | `aws_sns_topic_policy.cloud_brokering_alerts`                                  |
| update   | `aws_cloudwatch_event_target.cloud_brokering_sns_target`                       |
| recreate | `aws_sns_topic_subscription.sre_team_email`                                    |


</details>


**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/cds-aws-lz/actions/runs/16036865373).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_event_rule.guardrails_breakglass_signin_monitoring will be created
  + resource "aws_cloudwatch_event_rule" "guardrails_breakglass_signin_monitoring" {
      + arn            = (known after apply)
      + description    = "Monitor AWS Console sign-in events for breakglass IAM users"
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + detail      = {
                  + eventName    = [
                      + "ConsoleLogin",
                    ]
                  + userIdentity = {
                      + type     = [
                          + "IAMUser",
                        ]
                      + userName = [
                          + "ops1",
                          + "ops2",
                        ]
                    }
                }
              + detail-type = [
                  + "AWS Console Sign In via CloudTrail",
                ]
              + source      = [
                  + "aws.signin",
                ]
            }
        )
      + force_destroy  = false
      + id             = (known after apply)
      + name           = "guardrails-breakglass-signin-monitoring"
      + name_prefix    = (known after apply)
      + state          = "ENABLED"
      + tags_all       = (known after apply)
    }

  # aws_cloudwatch_event_rule.guardrails_iam_admin_policy_monitoring_demotion will be created
  + resource "aws_cloudwatch_event_rule" "guardrails_iam_admin_policy_monitoring_demotion" {
      + arn            = (known after apply)
      + description    = "Monitor IAM AdministratorAccess policy detachment events"
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + detail      = {
                  + eventName         = [
                      + "DetachUserPolicy",
                      + "DetachGroupPolicy",
                      + "DetachRolePolicy",
                    ]
                  + requestParameters = {
                      + policyArn = [
                          + {
                              + suffix = "policy/AdministratorAccess"
                            },
                        ]
                    }
                }
              + detail-type = [
                  + "AWS API Call via CloudTrail",
                ]
              + source      = [
                  + "aws.iam",
                ]
            }
        )
      + force_destroy  = false
      + id             = (known after apply)
      + name           = "guardrails-iam-admin-policy-monitoring-demotion"
      + name_prefix    = (known after apply)
      + state          = "ENABLED"
      + tags_all       = (known after apply)
    }

  # aws_cloudwatch_event_rule.guardrails_iam_admin_policy_monitoring_promotion will be created
  + resource "aws_cloudwatch_event_rule" "guardrails_iam_admin_policy_monitoring_promotion" {
      + arn            = (known after apply)
      + description    = "Monitor IAM AdministratorAccess policy attachment events"
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + detail      = {
                  + eventName         = [
                      + "AttachUserPolicy",
                      + "AttachGroupPolicy",
                      + "AttachRolePolicy",
                    ]
                  + requestParameters = {
                      + policyArn = [
                          + {
                              + suffix = "policy/AdministratorAccess"
                            },
                        ]
                    }
                }
              + detail-type = [
                  + "AWS API Call via CloudTrail",
                ]
              + source      = [
                  + "aws.iam",
                ]
            }
        )
      + force_destroy  = false
      + id             = (known after apply)
      + name           = "guardrails-iam-admin-policy-monitoring-promotion"
      + name_prefix    = (known after apply)
      + state          = "ENABLED"
      + tags_all       = (known after apply)
    }

  # aws_cloudwatch_event_rule.guardrails_kms_monitoring will be created
  + resource "aws_cloudwatch_event_rule" "guardrails_kms_monitoring" {
      + arn            = (known after apply)
      + description    = "Monitor KMS key usage and access changes"
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + detail      = {
                  + eventName = [
                      + "CreateKey",
                      + "ScheduleKeyDeletion",
                      + "CancelKeyDeletion",
                      + "DisableKey",
                      + "EnableKey",
                      + "PutKeyPolicy",
                      + "UpdateKeyDescription",
                    ]
                }
              + detail-type = [
                  + "AWS API Call via CloudTrail",
                ]
              + source      = [
                  + "aws.kms",
                ]
            }
        )
      + force_destroy  = false
      + id             = (known after apply)
      + name           = "guardrails-kms-monitoring"
      + name_prefix    = (known after apply)
      + state          = "ENABLED"
      + tags_all       = (known after apply)
    }

  # aws_cloudwatch_event_rule.guardrails_root_signin_monitoring will be created
  + resource "aws_cloudwatch_event_rule" "guardrails_root_signin_monitoring" {
      + arn            = (known after apply)
      + description    = "Monitor AWS Console sign-in events for root user"
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + detail      = {
                  + eventName    = [
                      + "ConsoleLogin",
                    ]
                  + userIdentity = {
                      + type = [
                          + "Root",
                        ]
                    }
                }
              + detail-type = [
                  + "AWS Console Sign In via CloudTrail",
                ]
            }
        )
      + force_destroy  = false
      + id             = (known after apply)
      + name           = "guardrails-root-signin-monitoring"
      + name_prefix    = (known after apply)
      + state          = "ENABLED"
      + tags_all       = (known after apply)
    }

  # aws_cloudwatch_event_rule.guardrails_secrets_manager_monitoring will be created
  + resource "aws_cloudwatch_event_rule" "guardrails_secrets_manager_monitoring" {
      + arn            = (known after apply)
      + description    = "Monitor AWS Secrets Manager operations"
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + detail      = {
                  + eventName = [
                      + "CreateSecret",
                      + "UpdateSecret",
                      + "PutSecretValue",
                      + "DeleteSecret",
                      + "RestoreSecret",
                      + "RotateSecret",
                    ]
                }
              + detail-type = [
                  + "AWS API Call via CloudTrail",
                ]
              + source      = [
                  + "aws.secretsmanager",
                ]
            }
        )
      + force_destroy  = false
      + id             = (known after apply)
      + name           = "guardrails-secrets-manager-monitoring"
      + name_prefix    = (known after apply)
      + state          = "ENABLED"
      + tags_all       = (known after apply)
    }

  # aws_cloudwatch_event_target.cloud_brokering_sns_target will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "cloud_brokering_sns_target" {
      ~ arn            = "arn:aws:sns:ca-central-1:659087519042:cloud-brokering-security-alerts" -> (known after apply)
        id             = "cloud-brokering-iam-monitoring-CloudBrokeringSNSTarget"
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_cloudwatch_event_target.guardrails_breakglass_signin_sns_target will be created
  + resource "aws_cloudwatch_event_target" "guardrails_breakglass_signin_sns_target" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = "guardrails-breakglass-signin-monitoring"
      + target_id      = "GuardrailsBreakglassSignInSNSTarget"

      + input_transformer {
          + input_paths    = {
              + "awsRegion"        = "$.detail.awsRegion"
              + "errorCode"        = "$.detail.errorCode"
              + "errorMessage"     = "$.detail.errorMessage"
              + "eventId"          = "$.detail.eventId"
              + "eventName"        = "$.detail.eventName"
              + "eventTime"        = "$.detail.eventTime"
              + "responseElements" = "$.detail.responseElements"
              + "sourceIPAddress"  = "$.detail.sourceIPAddress"
              + "userArn"          = "$.detail.userIdentity.arn"
              + "userName"         = "$.detail.userIdentity.userName"
              + "userType"         = "$.detail.userIdentity.type"
            }
          + input_template = jsonencode(
                {
                  + action_required = "IMMEDIATE REVIEW REQUIRED: Breakglass account used - verify emergency access was authorized and document the incident"
                  + alert_type      = "BREAKGLASS_SIGNIN_SECURITY_EVENT"
                  + error_code      = "<errorCode>"
                  + error_message   = "<errorMessage>"
                  + event_id        = "<eventId>"
                  + event_name      = "<eventName>"
                  + event_time      = "<eventTime>"
                  + login_status    = "<responseElements>"
                  + message         = "🚨 BREAKGLASS ALERT: Emergency user '<userName>' accessed console at <eventTime> from IP <sourceIPAddress>"
                  + region          = "<awsRegion>"
                  + severity        = "CRITICAL"
                  + source_ip       = "<sourceIPAddress>"
                  + user_arn        = "<userArn>"
                  + user_name       = "<userName>"
                  + user_type       = "<userType>"
                }
            )
        }
    }

  # aws_cloudwatch_event_target.guardrails_iam_admin_demotion_policy_sns_target will be created
  + resource "aws_cloudwatch_event_target" "guardrails_iam_admin_demotion_policy_sns_target" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = "guardrails-iam-admin-policy-monitoring-demotion"
      + target_id      = "GuardrailsIAMAdminPolicySNSTarget"

      + input_transformer {
          + input_paths    = {
              + "awsRegion"       = "$.detail.awsRegion"
              + "eventId"         = "$.detail.eventId"
              + "eventName"       = "$.detail.eventName"
              + "eventTime"       = "$.detail.eventTime"
              + "policyArn"       = "$.detail.requestParameters.policyArn"
              + "sourceIPAddress" = "$.detail.sourceIPAddress"
              + "targetGroup"     = "$.detail.requestParameters.groupName"
              + "targetRole"      = "$.detail.requestParameters.roleName"
              + "targetUser"      = "$.detail.requestParameters.userName"
              + "userArn"         = "$.detail.userIdentity.arn"
            }
          + input_template = jsonencode(
                {
                  + action_required = "IMMEDIATE REVIEW REQUIRED: AdministratorAccess policy has been detached - verify this was authorized"
                  + alert_type      = "IAM_ADMIN_POLICY_DETACHMENT"
                  + event_id        = "<eventId>"
                  + event_name      = "<eventName>"
                  + event_time      = "<eventTime>"
                  + message         = "🚨 CRITICAL IAM ALERT: AdministratorAccess policy detached via '<eventName>' at <eventTime> by <userArn> from IP <sourceIPAddress>"
                  + policy_arn      = "<policyArn>"
                  + region          = "<awsRegion>"
                  + severity        = "CRITICAL"
                  + source_ip       = "<sourceIPAddress>"
                  + target_group    = "<targetGroup>"
                  + target_role     = "<targetRole>"
                  + target_user     = "<targetUser>"
                  + user_arn        = "<userArn>"
                }
            )
        }
    }

  # aws_cloudwatch_event_target.guardrails_iam_admin_promotion_policy_sns_target will be created
  + resource "aws_cloudwatch_event_target" "guardrails_iam_admin_promotion_policy_sns_target" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = "guardrails-iam-admin-policy-monitoring-promotion"
      + target_id      = "GuardrailsIAMAdminPromotionPolicySNSTarget"

      + input_transformer {
          + input_paths    = {
              + "awsRegion"       = "$.detail.awsRegion"
              + "eventId"         = "$.detail.eventId"
              + "eventName"       = "$.detail.eventName"
              + "eventTime"       = "$.detail.eventTime"
              + "policyArn"       = "$.detail.requestParameters.policyArn"
              + "sourceIPAddress" = "$.detail.sourceIPAddress"
              + "targetGroup"     = "$.detail.requestParameters.groupName"
              + "targetRole"      = "$.detail.requestParameters.roleName"
              + "targetUser"      = "$.detail.requestParameters.userName"
              + "userArn"         = "$.detail.userIdentity.arn"
            }
          + input_template = jsonencode(
                {
                  + action_required = "IMMEDIATE REVIEW REQUIRED: AdministratorAccess policy has been attached - verify this was authorized and follows principle of least privilege"
                  + alert_type      = "IAM_ADMIN_POLICY_ATTACHMENT"
                  + event_id        = "<eventId>"
                  + event_name      = "<eventName>"
                  + event_time      = "<eventTime>"
                  + message         = "🚨 CRITICAL IAM ALERT: AdministratorAccess policy attached via '<eventName>' at <eventTime> by <userArn> from IP <sourceIPAddress>"
                  + policy_arn      = "<policyArn>"
                  + region          = "<awsRegion>"
                  + severity        = "CRITICAL"
                  + source_ip       = "<sourceIPAddress>"
                  + target_group    = "<targetGroup>"
                  + target_role     = "<targetRole>"
                  + target_user     = "<targetUser>"
                  + user_arn        = "<userArn>"
                }
            )
        }
    }

  # aws_cloudwatch_event_target.guardrails_kms_sns_target will be created
  + resource "aws_cloudwatch_event_target" "guardrails_kms_sns_target" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = "guardrails-kms-monitoring"
      + target_id      = "GuardrailsKMSSNSTarget"

      + input_transformer {
          + input_paths    = {
              + "awsRegion"       = "$.detail.awsRegion"
              + "eventId"         = "$.detail.eventId"
              + "eventName"       = "$.detail.eventName"
              + "eventTime"       = "$.detail.eventTime"
              + "keyArn"          = "$.detail.responseElements.keyMetadata.arn"
              + "keyId"           = "$.detail.responseElements.keyMetadata.keyId"
              + "sourceIPAddress" = "$.detail.sourceIPAddress"
              + "userArn"         = "$.detail.userIdentity.arn"
            }
          + input_template = jsonencode(
                {
                  + action_required = "Review this KMS activity to ensure it was authorized"
                  + alert_type      = "KMS_SECURITY_EVENT"
                  + event_id        = "<eventId>"
                  + event_name      = "<eventName>"
                  + event_time      = "<eventTime>"
                  + kms_key_arn     = "<keyArn>"
                  + kms_key_id      = "<keyId>"
                  + message         = "🔐 KMS ALERT: '<eventName>' performed on KMS key at <eventTime> by <userArn> from IP <sourceIPAddress>"
                  + region          = "<awsRegion>"
                  + severity        = "HIGH"
                  + source_ip       = "<sourceIPAddress>"
                  + user_arn        = "<userArn>"
                }
            )
        }
    }

  # aws_cloudwatch_event_target.guardrails_root_signin_sns_target will be created
  + resource "aws_cloudwatch_event_target" "guardrails_root_signin_sns_target" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = "guardrails-root-signin-monitoring"
      + target_id      = "GuardrailsRootSignInSNSTarget"

      + input_transformer {
          + input_paths    = {
              + "accountId"        = "$.detail.userIdentity.accountId"
              + "awsRegion"        = "$.detail.awsRegion"
              + "errorCode"        = "$.detail.errorCode"
              + "errorMessage"     = "$.detail.errorMessage"
              + "eventId"          = "$.detail.eventId"
              + "eventName"        = "$.detail.eventName"
              + "eventTime"        = "$.detail.eventTime"
              + "responseElements" = "$.detail.responseElements"
              + "sourceIPAddress"  = "$.detail.sourceIPAddress"
              + "userArn"          = "$.detail.userIdentity.arn"
              + "userType"         = "$.detail.userIdentity.type"
            }
          + input_template = jsonencode(
                {
                  + account_id      = "<accountId>"
                  + action_required = "IMMEDIATE REVIEW REQUIRED: Root account used - verify this was authorized emergency access and document the incident. Root access should be extremely rare."
                  + alert_type      = "ROOT_SIGNIN_SECURITY_EVENT"
                  + error_code      = "<errorCode>"
                  + error_message   = "<errorMessage>"
                  + event_id        = "<eventId>"
                  + event_name      = "<eventName>"
                  + event_time      = "<eventTime>"
                  + login_status    = "<responseElements>"
                  + message         = "🚨 CRITICAL ROOT ACCESS ALERT: Root user accessed console at <eventTime> from IP <sourceIPAddress>"
                  + region          = "<awsRegion>"
                  + severity        = "CRITICAL"
                  + source_ip       = "<sourceIPAddress>"
                  + user_arn        = "<userArn>"
                  + user_type       = "<userType>"
                }
            )
        }
    }

  # aws_cloudwatch_event_target.guardrails_secrets_manager_sns_target will be created
  + resource "aws_cloudwatch_event_target" "guardrails_secrets_manager_sns_target" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = "guardrails-secrets-manager-monitoring"
      + target_id      = "GuardrailsSecretsManagerSNSTarget"

      + input_transformer {
          + input_paths    = {
              + "awsRegion"       = "$.detail.awsRegion"
              + "eventId"         = "$.detail.eventId"
              + "eventName"       = "$.detail.eventName"
              + "eventTime"       = "$.detail.eventTime"
              + "secretArn"       = "$.detail.responseElements.arn"
              + "secretId"        = "$.detail.responseElements.versionId"
              + "secretName"      = "$.detail.requestParameters.name"
              + "sourceIPAddress" = "$.detail.sourceIPAddress"
              + "userArn"         = "$.detail.userIdentity.arn"
            }
          + input_template = jsonencode(
                {
                  + action_required = "Review this Secrets Manager activity to ensure it was authorized and follows security protocols"
                  + alert_type      = "SECRETS_MANAGER_SECURITY_EVENT"
                  + event_id        = "<eventId>"
                  + event_name      = "<eventName>"
                  + event_time      = "<eventTime>"
                  + message         = "🔐 SECRETS MANAGER ALERT: '<eventName>' performed on secret at <eventTime> by <userArn> from IP <sourceIPAddress>"
                  + region          = "<awsRegion>"
                  + secret_arn      = "<secretArn>"
                  + secret_id       = "<secretId>"
                  + secret_name     = "<secretName>"
                  + severity        = "HIGH"
                  + source_ip       = "<sourceIPAddress>"
                  + user_arn        = "<userArn>"
                }
            )
        }
    }

  # aws_sns_topic.cloud_brokering_alerts will be destroyed
  # (because aws_sns_topic.cloud_brokering_alerts is not in configuration)
  - resource "aws_sns_topic" "cloud_brokering_alerts" {
      - application_success_feedback_sample_rate = 0 -> null
      - arn                                      = "arn:aws:sns:ca-central-1:659087519042:cloud-brokering-security-alerts" -> null
      - content_based_deduplication              = false -> null
      - delivery_policy                          = jsonencode(
            {
              - http = {
                  - defaultHealthyRetryPolicy    = {
                      - backoffFunction    = "linear"
                      - maxDelayTarget     = 20
                      - minDelayTarget     = 20
                      - numMaxDelayRetries = 0
                      - numMinDelayRetries = 0
                      - numNoDelayRetries  = 0
                      - numRetries         = 3
                    }
                  - disableSubscriptionOverrides = false
                }
            }
        ) -> null
      - fifo_topic                               = false -> null
      - firehose_success_feedback_sample_rate    = 0 -> null
      - http_success_feedback_sample_rate        = 0 -> null
      - id                                       = "arn:aws:sns:ca-central-1:659087519042:cloud-brokering-security-alerts" -> null
      - kms_master_key_id                        = "alias/aws/sns" -> null
      - lambda_success_feedback_sample_rate      = 0 -> null
      - name                                     = "cloud-brokering-security-alerts" -> null
      - owner                                    = "659087519042" -> null
      - policy                                   = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "SNS:Publish"
                      - Condition = {
                          - StringEquals = {
                              - "aws:SourceAccount" = "659087519042"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "events.amazonaws.com"
                        }
                      - Resource  = "arn:aws:sns:ca-central-1:659087519042:cloud-brokering-security-alerts"
                      - Sid       = "AllowEventBridgePublish"
                    },
                  - {
                      - Action    = [
                          - "SNS:Publish",
                          - "SNS:RemovePermission",
                          - "SNS:SetTopicAttributes",
                          - "SNS:DeleteTopic",
                          - "SNS:ListSubscriptionsByTopic",
                          - "SNS:GetTopicAttributes",
                          - "SNS:AddPermission",
                          - "SNS:Subscribe",
                        ]
                      - Condition = {
                          - StringEquals = {
                              - "aws:SourceAccount" = "659087519042"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "*"
                        }
                      - Resource  = "arn:aws:sns:ca-central-1:659087519042:cloud-brokering-security-alerts"
                      - Sid       = "AccessPolicy"
                    },
                  - {
                      - Action    = "sns:Publish"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "events.amazonaws.com"
                        }
                      - Resource  = "arn:aws:sns:ca-central-1:659087519042:cloud-brokering-security-alerts"
                      - Sid       = "AWSEvents_gr01_rule_naming_test1_Idb7d59de4-a4e3-4a91-8564-bf14d104f356"
                    },
                  - {
                      - Action    = "sns:Publish"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "events.amazonaws.com"
                        }
                      - Resource  = "arn:aws:sns:ca-central-1:659087519042:cloud-brokering-security-alerts"
                      - Sid       = "AWSEvents_gr01_namingtest_breakglass_Idaebc80f8-fb26-4e79-b0c4-d3cc87a378ba"
                    },
                  - {
                      - Action    = "sns:Publish"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "events.amazonaws.com"
                        }
                      - Resource  = "arn:aws:sns:ca-central-1:659087519042:cloud-brokering-security-alerts"
                      - Sid       = "AWSEvents_gr01_naming_convention_privileged_policy_Id42db20ad-ca8e-490d-88fa-806c986262b8"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - signature_version                        = 0 -> null
      - sqs_success_feedback_sample_rate         = 0 -> null
      - tags                                     = {} -> null
      - tags_all                                 = {} -> null
    }

  # aws_sns_topic.guardrail_alerts will be created
  + resource "aws_sns_topic" "guardrail_alerts" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + delivery_policy             = jsonencode(
            {
              + http = {
                  + defaultHealthyRetryPolicy    = {
                      + backoffFunction    = "linear"
                      + maxDelayTarget     = 20
                      + minDelayTarget     = 20
                      + numMaxDelayRetries = 0
                      + numMinDelayRetries = 0
                      + numNoDelayRetries  = 0
                      + numRetries         = 3
                    }
                  + disableSubscriptionOverrides = false
                }
            }
        )
      + fifo_topic                  = false
      + id                          = (known after apply)
      + kms_master_key_id           = "alias/aws/sns"
      + name                        = "guardrails-security-alerts"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # aws_sns_topic_policy.cloud_brokering_alerts will be destroyed
  # (because aws_sns_topic_policy.cloud_brokering_alerts is not in configuration)
  - resource "aws_sns_topic_policy" "cloud_brokering_alerts" {
      - arn    = "arn:aws:sns:ca-central-1:659087519042:cloud-brokering-security-alerts" -> null
      - id     = "arn:aws:sns:ca-central-1:659087519042:cloud-brokering-security-alerts" -> null
      - owner  = "659087519042" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "SNS:Publish"
                      - Condition = {
                          - StringEquals = {
                              - "aws:SourceAccount" = "659087519042"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "events.amazonaws.com"
                        }
                      - Resource  = "arn:aws:sns:ca-central-1:659087519042:cloud-brokering-security-alerts"
                      - Sid       = "AllowEventBridgePublish"
                    },
                  - {
                      - Action    = [
                          - "SNS:Publish",
                          - "SNS:RemovePermission",
                          - "SNS:SetTopicAttributes",
                          - "SNS:DeleteTopic",
                          - "SNS:ListSubscriptionsByTopic",
                          - "SNS:GetTopicAttributes",
                          - "SNS:AddPermission",
                          - "SNS:Subscribe",
                        ]
                      - Condition = {
                          - StringEquals = {
                              - "aws:SourceAccount" = "659087519042"
                            }
                       ...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cloud_brokering_monitoring"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.guardrails_breakglass_signin_monitoring"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.guardrails_iam_admin_policy_monitoring_demotion"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.guardrails_iam_admin_policy_monitoring_promotion"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.guardrails_kms_monitoring"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.guardrails_root_signin_monitoring"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.guardrails_secrets_manager_monitoring"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.guardrail_alerts"]

27 tests, 19 passed, 8 warnings, 0 failures, 0 exceptions

```

</details>
